content/elk/logstash-guide.org
# -*- coding:utf-8-*-
#+TITLE: logstash
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述
  [[https://www.elastic.co/guide/en/logstash/current/index.html][logstash guide]]

* Getting started with logstash

** stashing your first event
  创建测试网络：
  #+BEGIN_SRC sh
docker network create elk
  #+END_SRC
  启动容器：
  #+BEGIN_SRC sh
docker run -d \
--name elasticsearch \
--net elk \
-p 9200:9200 -p 9300:9300 \
-e "discovery.type=single-node" \
elasticsearch:7.3.2

docker run -it --rm \
--name logstash \
--net elk \
logstash:7.5.1 /bin/bash
  #+END_SRC

  在 logstash container 中启动 logstash，
  #+BEGIN_SRC sh
logstash -e 'input { stdin { } } output { stdout {} }
  #+END_SRC

  logstash 完成一系列启动动作，打印日志到屏幕：
  #+begin_example
[2020-02-04T13:53:54,546][INFO ][logstash.javapipeline    ] Pipeline started {"pipeline.id"=>"main"}
The stdin plugin is now waiting for input:
  #+end_example
  完成后输入 =hello,world= ，可以看到 logstash 打印了处理后的相关消息：
  #+begin_example
[2020-02-04T13:45:26,536][INFO ][logstash.agent           ] Pipelines running {:count=>2, :running_pipelines=>[:".monitoring-logstash", :main], :non_running_pipelines=>[]}
[2020-02-04T13:45:26,807][INFO ][logstash.agent           ] Successfully started Logstash API endpoint {:port=>9600}
hello,world
/usr/share/logstash/vendor/bundle/jruby/2.5.0/gems/awesome_print-1.7.0/lib/awesome_print/formatters/base_formatter.rb:31: warning: constant ::Fixnum is deprecated
{
      "@version" => "1",
          "host" => "7fb26edd3fd9",
       "message" => "hello,world",
    "@timestamp" => 2020-02-04T13:46:37.801Z
}
  #+end_example

** Parsing Logs with Logstash

   使用 filebeat 监控日志，然后讲请求转发到 logstash，处理后转发到 es，通过 kinbana 进行展示。

*** 配置 filebeat 讲日志发送到 logstash

   #+BEGIN_SRC sh
docker run -it --rm \
  --net elk \
  --name=filebeat \
  --volume="$(pwd):/data" \
  docker.elastic.co/beats/filebeat:7.5.2 /bin/bash
   #+END_SRC
   启动 filebeat：
   #+BEGIN_SRC sh
./filebeat -e -c /data/filebeat.yml -d "publish"
   #+END_SRC

*** 为 filebeat 配置 logstash
    #+BEGIN_SRC sh
docker run -it --rm \
--name logstash \
--volume="$(pwd):/data" \
--net elk \
logstash:7.5.1 /bin/bash
    #+END_SRC

    启动 logstash：
    #+BEGIN_SRC sh
bin/logstash -f /data/first-pipeline.conf --config.reload.automatic
    #+END_SRC

    如果 pipeline 设置正常，会看到很多如下的日志：
    #+BEGIN_SRC json
{
    "@timestamp" => 2017-11-09T01:44:20.071Z,
        "offset" => 325,
      "@version" => "1",
          "beat" => {
            "name" => "My-MacBook-Pro.local",
        "hostname" => "My-MacBook-Pro.local",
         "version" => "6.0.0"
    },
          "host" => "My-MacBook-Pro.local",
    "prospector" => {
        "type" => "log"
    },
    "input" => {
        "type" => "log"
    },
        "source" => "/path/to/file/logstash-tutorial.log",
       "message" => "83.149.9.216 - - [04/Jan/2015:05:13:42 +0000] \"GET /presentations/logstash-monitorama-2013/images/kibana-search.png HTTP/1.1\" 200 203023 \"http://semicomplete.com/presentations/logstash-monitorama-2013/\" \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/32.0.1700.77 Safari/537.36\"",
          "tags" => [
        [0] "beats_input_codec_plain_applied"
    ]
}
    #+END_SRC

*** 使用 Grok 过滤插件解析 web 日志
